In [504]:
import pandas as pd
import numpy as np

####################################################
################### Regular Class ####################
####################################################

In [ ]:
### instance/class variables and method

In [ ]:
### Practice by coding before interview

In [1]:
class drink:
    
    """ class variables"""
    form = 'liquid'
    served_as = 'cold'
    
    def __init__(self, is_alcoholic, alc_content, color):
        self.is_alcoholic = is_alcoholic
        self.alc_content = alc_content
        self.color = color
    
    def inc_alc_content(self, val):
        self.alc_content += val
    
    def change_served_as(self, val):
        self.served_as = val
    
    """class method"""
    @classmethod # decorator
    def cl_change_served_as(cls, val):
        cls.served_as = val

In [ ]:
class testMOD(object):
    def testFunc(self, variable):
        var = variable
        self.something = var + 12
        print('Original:', self.something)

def alternativeFunc1(self, variable):
    var = variable
    self.something = var + 1.2
    print('Alternative1:', self.something)

mytest1 = testMOD()
mytest1.testFunc(10)   # Original: 22

mytest1.testFunc = alternativeFunc1.__get__(mytest1, testMOD)
mytest1.testFunc(10)   # Alternative1: 11.2
mytestX = testMOD()
mytestX.testFunc(10)   # Original: 22

6

2
1

4

In [753]:
# create instance, access instance vars and methods
beer = drink('y', 4, 'golden')
print(beer.alc_content)
beer.inc_alc_content(1)
print(beer.alc_content)
print(beer.__dict__) # access all vars, methods of instance

whisky = drink('y', 42, 'golden')
print(whisky.alc_content)

4
5
{'is_alcoholic': 'y', 'alc_content': 5, 'color': 'golden'}
42

In [103]:
# see details of class and instance
print(beer.__dict__)
print(help(drink))

{'is_alcoholic': 'y', 'alc_content': 5, 'color': 'golden'}
Help on class drink in module __main__:

class drink(builtins.object)
 |  class variables
 |
 |  Methods defined here:
 |
 |  __init__(self, is_alcoholic, alc_content, color)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  change_served_as(self, val)
 |
 |  inc_alc_content(self, val)
 |
 |  ----------------------------------------------------------------------
 |  Class methods defined here:
 |
 |  cl_change_served_as(val) from builtins.type
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes defined here:
 |
 |  form = 'liquid'
 |
 |  served_as = 'cold'

None

In [104]:
# access class variables
print(drink.served_as)
print(beer.served_as)

cold
cold

In [105]:
# change 'class var' for 1 instance only
beer.change_served_as('very cold') # called using 'class name'
print(beer.served_as)
print(whisky.served_as)

very cold
cold

In [106]:
# change 'class var' using 'class method'
drink.cl_change_served_as('chilled')
print(beer.served_as) # since 'served_as' was set for beer, it didn't change
print(whisky.served_as)

very cold
chilled

####################################################
############## Function Over-ride #################
####################################################

In [780]:
# Over-ride an existing function for an object
print(beer.alc_content)
def dec_dec(self, val): # reduce alc_content
    self.alc_content -= val
beer.inc_alc_content = dec_dec.__get__(beer, drink) # over-ride inc function with dec
beer.inc_alc_content(1)
print(beer.alc_content)

0
-1

####################################################
#################### Inheritance #####################
####################################################

In [177]:
class juice(drink):
    
    served_as = 'normal' # over-writes 'drink' cls variable
    is_packed = 'y'
    
    def __init__(self, is_alcoholic, alc_content, color, preservative):
        super().__init__(is_alcoholic, alc_content, color)
#         drink.__init__(self, is_alcoholic, alc_content, color) # works same as 'super()'
        self.preservative = {preservative} # set to maintain unique items
    
    def add_preservative(self, p):
        self.preservative.add(p)
        
    def remove_preservative(self, p):
        self.preservative = self.preservative.difference({p})

In [178]:
# create instance of sub-class; use sub-class vars and methods
orange_juice = juice('n', 0, 'orange','p2')
print(orange_juice.served_as)
print(orange_juice.preservative)

orange_juice.add_preservative('p23')
orange_juice.add_preservative('p27')
orange_juice.add_preservative('p23')
print(orange_juice.preservative)

orange_juice.remove_preservative('p23')
print(orange_juice.preservative)

normal
{'p2'}
{'p27', 'p23', 'p2'}
{'p27', 'p2'}

####################################################
####### Magic/Dunder/Special Method, Operator Overloading
####################################################

In [243]:
# 'dunder init' or '__init__' is the most common dunder method

In [261]:
class mocktails(drink):
    
    def __init__(self, is_alcoholic, alc_content, color, flavor):
        super().__init__(is_alcoholic, alc_content, color)
        self.flavor = flavor
        
    def __repr__(self): # for developers - unambiguous representation
        return (str(self.__dict__)) # repr() should return string
        
    def __str__(self): # for users
        return ("It is a drink with {}% alcohol content and flavor of '{}'".format(
            self.alc_content, self.flavor)) # str() should return string
    
    def __add__(self, other):
        return (self.alc_content + other.alc_content)
    
#     def __alc__(self): # won't work as __alc__ is not predifined special method
#         return (self.alc_content)
    
    def __len__(self):
        return (self.alc_content)

In [262]:
virgin_mojito = mocktails('n', 0, 'no color', 'mint')
print(repr(virgin_mojito))
# virgin_mojito.__repr__() # same as repr()
print(str(virgin_mojito))
# virgin_mojito.__str__() # same as str()

{'is_alcoholic': 'n', 'alc_content': 0, 'color': 'no color', 'flavor': 'mint'}
It is a drink with 0% alcohol content and flavor of 'mint'

In [263]:
mojito = mocktails('y', 8, 'no color', 'mint')
print(virgin_mojito + mojito) # returns added 'acl_content' of 2 drinks

8

In [264]:
# print(alc(virgin_mojito)) # won't work as __alc__ is not predifined special method
print(len(virgin_mojito)) # alternate way to get alc_content using __len__ special method

0

In [265]:
# Other 'special' methods
     # https://docs.python.org/3/reference/datamodel.html#special-method-names
# other examples: __len__, __del__

In [266]:
# another special method '__name__'
if __name__ == '__main__': 
    print('this is the main program')

this is the main program

####################################################
####### Property Decorator - Getter/Setter/Deleter
####################################################

In [371]:
class car:
    
    def __init__(self, brand, model, latest_price):
        self.brand = brand
        self.model = model
        self.__latest_price = latest_price # __ means stay away from; used instead of private
#         self.price = price # can't use while using 'getter' below
    
    @property # getter
    def price(self):
        price = self.__latest_price
        return(price)
    
    @price.setter # setter 
    def price(self, p):
        if p > 5000000:
            print('Cannot set this price') # this is the benefit of property decorator
        else:
            self.__latest_price = p
            return self.__latest_price
    
    @price.deleter # deleter
    def price(self):
        self.__latest_price = None
        return self.__latest_price

In [372]:
# using 'getter'
bmw_c_series = car('BMW', 'C_Series', 4200000)
bmw_c_series.__dict__
bmw_c_series.price # getter

4200000

In [375]:
# using 'setter'
bmw_c_series.price = 4500000
print(bmw_c_series.price)

# using 'setter'
bmw_c_series.price = 5100000 
print(bmw_c_series.price)

4500000
Cannot set this price
4500000

In [335]:
# using 'deleter'
del bmw_c_series.price
bmw_c_series.price

In [ ]:
# benefits: can avoid someone from setting a variable to a particular value

####################################################
####### Decorator - Changes behaviour of function
####################################################

In [ ]:
# ref: https://www.geeksforgeeks.org/decorators-in-python/

####################################################
############## args & kwargs
####################################################

####################################################
############## List Comprehension / Dict Comprehensio
####################################################

In [380]:
# List Comprehension - faster than for loops
xx = [1, 2, 3, 4]
yy = [x*2 for x in xx if x%2==0] # double the even numbers
yy

[4, 8]

In [386]:
# Dict Comprehension - faster than for loops
xx = {'k1':23, 'k2':44}
yy = {k:v for (k,v) in zip(xx.keys(), xx.values()) if v>30}
yy

{'k2': 44}

####################################################
############## Dataframe Operations (Pandas)
####################################################

In [665]:
# create dataframe
import pandas as pd 
data = [['tom', 10, 6.1], ['nick', 15, 5.8], ['julie', 14, 5.7], ['annie', 15, 5.4]] 
df = pd.DataFrame(data, columns = ['Name', 'Age', 'Height']) 
print(df)

import pandas as pd 
data = [['tom', 10, 6.1], ['nick', 15, 5.8], ['arnold', 11, 5.6], ['sam', 13, 5.7]] 
dff = pd.DataFrame(data, columns = ['Name', 'Age', 'Height']) 
print(dff)

# create dataframe (with Nulls)
import pandas as pd 
data = [['tom', 10, 6.1], ['nick', 15, 5.8], [None, 14, 5.7], ['annie', 15, None]] 
dfx = pd.DataFrame(data, columns = ['Name', 'Age', 'Height']) 
print(dfx)

    Name  Age  Height
0    tom   10     6.1
1   nick   15     5.8
2  julie   14     5.7
3  annie   15     5.4
     Name  Age  Height
0     tom   10     6.1
1    nick   15     5.8
2  arnold   11     5.6
3     sam   13     5.7
    Name  Age  Height
0    tom   10     6.1
1   nick   15     5.8
2   None   14     5.7
3  annie   15     NaN

In [616]:
# access columns, rows and cells
# cols
df['Height'] # col by name
df[['Name','Height']] # cols by name
df.iloc[:,1] # col by location (uses index)
df.iloc[:,0:2] # cols by location (uses index)
# rows
df.iloc[1,:] # row by location
df.iloc[0:2,:] # rows by location
df[0:2] # rows by location
# cell
df['Height'][1] # cell by name
df.iat[1,1] # cell by location (uses position, not index)

15

In [408]:
# sort
df.sort_values(['Age', 'Height'], ascending=[False, False])

    Name  Age  Height
1   nick   15     5.8
3  annie   15     5.4
2   juli   14     5.7
0    tom   10     6.1

In [709]:
# drop duplicates
df1 = df.drop_duplicates(['Name','Age'], keep='first')
df1 = df.drop_duplicates(['Name','Age'], keep='last')
df1 = df.drop_duplicates(['Age'], keep=False)
df1

    Name  Age  Height
0    tom   10     6.1
2  julie   14     5.7

In [434]:
# conditional replace in column
df1 = df.copy()
df1.loc[ (df1['Height']>5.7) & (df1['Age']>=15) , ['Age','Height']] = [16, 6.0]
df1

    Name  Age  Height
0    tom   10     6.1
1   nick   16     6.0
2  julie   14     5.7
3  annie   15     5.4

In [749]:
# filter rows in dataframe on condition
temp = df.loc[df['Height'] >= 5.8]
temp
# OR
temp = df.loc[df['Height'] >= 5.8, :]
temp

   Name  Age  Height
0   tom   10     6.1
1  nick   15     5.8

In [701]:
# replace sub-string in text column (with condition)
df1 = df.copy()
df1['Name'] = df1['Name'].apply(lambda x: x.replace('ie', 'ieee') if x=='julie' else x)
df1
# OR
df1 = df.copy()
df1['Name'] = df1['Name'].str.replace('ie','ieee')
df1

      Name  Age  Height
0      tom   10     6.1
1     nick   15     5.8
2  julieee   14     5.7
3  annieee   15     5.4

In [451]:
# replace Null in dataframe column
dfx1 = dfx.copy()
dfx1['Height'].fillna(5.5, inplace=True) # inplace=T replaces in the df itself
dfx1

    Name  Age  Height
0    tom   10     6.1
1   nick   15     5.8
2   None   14     5.7
3  annie   15     5.5

In [714]:
# replace Null in dataframe - all numeric columns
dfx1 = dfx.copy()
dfx1 = dfx1[list(dfx1.columns)].apply(lambda x: x.fillna(0) 
                                      if np.issubdtype(x.dtype, np.number) else x)
# OR dfx1[dfx1.columns.values]
dfx1

    Name  Age  Height
0    tom   10     6.1
1   nick   15     5.8
2   None   14     5.7
3  annie   15     0.0

In [532]:
# replace Null in dataframe - all non-numeric columns
dfx1 = dfx.copy()
dfx1 = dfx1[list(dfx1.columns)].apply(lambda x: x.fillna('Blank') 
                                      if np.issubdtype(x.dtype, np.number)==False else x)
dfx1

    Name  Age  Height
0    tom   10     6.1
1   nick   15     5.8
2  Blank   14     5.7
3  annie   15     NaN

In [535]:
# get frequency of each value in variable
dfx['Age'].value_counts()

15    2
10    1
14    1
Name: Age, dtype: int64

In [731]:
# drop rows where certain variables contain NA
dfx1 = dfx.copy()
dfx1 = dfx1.dropna(subset = ['Name', 'Height'])
dfx1

# drop rows where variables contain NA (all numeric)
col1 = []
dfx1 = dfx.copy()
for col in dfx1.columns:
    if np.issubdtype(dfx1[col].dtype, np.number):
        col1.append(col)
dfx2 = dfx1.dropna(subset = col1)
dfx2
# OR
num_vars = []
Temp = dfx1[dfx1.columns.values].apply(lambda x: num_vars.append(x.name) 
                                       if np.issubdtype(x,np.number) else x)
dfx2 = dfx.dropna(subset = num_vars)
dfx2

   Name  Age  Height
0   tom   10     6.1
1  nick   15     5.8
2  None   14     5.7

In [745]:
# concatenate 2 dataframe by rows
temp = pd.concat([df,dfx], axis=0)
temp

# concatenate 2 dataframe by columns
temp = pd.concat([df,dfx], axis=1)
temp

    Name  Age  Height   Name  Age  Height
0    tom   10     6.1    tom   10     6.1
1   nick   15     5.8   nick   15     5.8
2  julie   14     5.7   None   14     5.7
3  annie   15     5.4  annie   15     NaN

In [588]:
# subtract dataframes by rows (A-B) - by certain columns
dfx2 = pd.concat([df, dfx, dfx]).drop_duplicates(['Name'], keep=False)
dfx2

    Name  Age  Height
2  julie   14     5.7

In [650]:
# select columns in df
df[['Name', 'Age']] # by name
df.iloc[:,0:2] # by location
    # get column names
list(df.columns[[0,2]])
list(df.columns)
df.columns.values

# drop columns in df
df1 = df.drop(['Age', 'Height'], axis=1) # by name 
df1
df1 = df.drop(df.columns[[0, 2]], axis=1) # by location
df1

   Age
0   10
1   15
2   14
3   15

In [656]:
# select rows in df
df1 = df[0:2] # by location
# drop rows in df
df1 = df.drop([0,1], axis=0) # by location
df1

    Name  Age  Height
2  julie   14     5.7
3  annie   15     5.4

In [739]:
# groupby
temp = df.groupby(['Age'],as_index=False)['Height'].sum()
temp

   Age  Height
0   10     6.1
1   14     5.7
2   15    11.2

In [661]:
# rename columns
df1 = df.rename(columns = {'Name':'Name_1', 'Age':'Age_1'})
df1

  Name_1  Age_1  Height
0    tom     10     6.1
1   nick     15     5.8
2  julie     14     5.7
3  annie     15     5.4

In [675]:
# left join
temp = pd.merge(df, dff, how='left', on='Name')
print(temp)
# inner join
temp = pd.merge(df, dff, how='inner', on='Name')
print(temp)

    Name  Age_x  Height_x  Age_y  Height_y
0    tom     10       6.1   10.0       6.1
1   nick     15       5.8   15.0       5.8
2  julie     14       5.7    NaN       NaN
3  annie     15       5.4    NaN       NaN
   Name  Age_x  Height_x  Age_y  Height_y
0   tom     10       6.1     10       6.1
1  nick     15       5.8     15       5.8

In [685]:
# random sampling
msk = np.random.rand(len(df)) < 0.75
Train = df[msk]
Test = df[~msk]
print(Train)
print(Test)

   Name  Age  Height
0   tom   10     6.1
1  nick   15     5.8
    Name  Age  Height
2  julie   14     5.7
3  annie   15     5.4

In [688]:
# count rows/columns of df
print(len(df.columns))
print(len(df.index))

3
4

In [698]:
# create dataframe
list1 = [['Anil', 56, 1200], ['Sunil', 32, 1300], ['Harry', 43, 700]]
df1 = pd.DataFrame(list1, columns=['Name', 'Age', 'Salary'])
df1

    Name  Age  Salary
0   Anil   56    1200
1  Sunil   32    1300
2  Harry   43     700

In [663]:
df

    Name  Age  Height
0    tom   10     6.1
1   nick   15     5.8
2  julie   14     5.7
3  annie   15     5.4

In [666]:
dff

     Name  Age  Height
0     tom   10     6.1
1    nick   15     5.8
2  arnold   11     5.6
3     sam   13     5.7